Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan

aws_lb.lb_ecs: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:398963803929:loadbalancer/app/lb-ecs/1ba5a14d83255d1b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_autoscaling_group.atlantis_ecs will be created
+ resource "aws_autoscaling_group" "atlantis_ecs" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 4
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 1
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = "atlantis_ecs"
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "foobar3-terraform-test"
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-01eb577852a061ca1",
          + "subnet-0b8ec0c0cc65e83fe",
          + "subnet-0e5e136aa686c7336",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Env"
          + propagate_at_launch = false
          + value               = "teste"
        }
      + tag {
          + key                 = "foo"
          + propagate_at_launch = true
          + value               = "bar"
        }

      + timeouts {
          + delete = "15m"
        }
    }

  # aws_launch_configuration.ubuntu_20_04 will be created
+ resource "aws_launch_configuration" "ubuntu_20_04" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0fb653ca2d3203ac1"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = "atlantis_ecs"
      + name_prefix                 = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_lb_listener.front_end will be created
+ resource "aws_lb_listener" "front_end" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-2:398963803929:loadbalancer/app/lb-ecs/1ba5a14d83255d1b"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.tg_ecs will be created
+ resource "aws_lb_target_group" "tg_ecs" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "tg-ecs"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0bddd935f8d84ba49"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_placement_group.atlantis_ecs will be created
+ resource "aws_placement_group" "atlantis_ecs" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "test"
      + partition_count    = (known after apply)
      + placement_group_id = (known after apply)
      + strategy           = "cluster"
      + tags_all           = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
